In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()

In [5]:
df 
#Empty data frame

Empty DataFrame
Columns: []
Index: []

In [20]:
df1 = pd.DataFrame([[1,2,3,4],
                    [5,6,7,8],
                    [1,2,3,4],
                   [7,9,11,2],
                   [1,2,3,4]])

In [21]:
df1
#works only in jupter notebook
#use print(df1) in pychamp

   0  1   2  3
0  1  2   3  4
1  5  6   7  8
2  1  2   3  4
3  7  9  11  2
4  1  2   3  4

In [22]:
df1.head(1)
#Initial rows

   0  1  2  3
0  1  2  3  4

In [23]:
df1.tail(2)
#last rows

   0  1   2  3
3  7  9  11  2
4  1  2   3  4

In [25]:
df1.shape
#Dimensions in the data frame

(5, 4)

In [28]:
df1.iloc[0,1]
#iloc function returns the specific element

2

In [30]:
df1.iloc[0:2,0:3]
#To display first two rows, first three columns

   0  1  2
0  1  2  3
1  5  6  7

In [31]:
df1 = pd.DataFrame([[1,2,3,4],
                    [5,6,7,8],
                    [1,2,3,4],
                   [7,9,11,2],
                   [1,2,3,4]],
                  columns = ['A', 'B', 'C', 'D'])
#Renaming columns

In [32]:
df1
#After renaming columns

   A  B   C  D
0  1  2   3  4
1  5  6   7  8
2  1  2   3  4
3  7  9  11  2
4  1  2   3  4

In [36]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
#Creating a series with numbers and a NULL value
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64